OpenFOAM-v1812/tutorials/lagrangian/reactingParcelFoam/airRecirculationRoom/steady/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoSimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          1;

writeControl    timeStep;

writeInterval   10;

purgeWrite      2;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable true;

maxCo           1;

maxDeltaT       1;

functions
{
    fieldMinMax
    {
        type                fieldMinMax;
        libs                (fieldFunctionObjects);
        fields              ( U p T);
        mode                magnitude;
        writeControl        timeStep;
        writeInterval       1;
        log                 yes;
    }
}


// ************************************************************************* //
